In [9]:
import numpy as np
import pandas as pd

In [2]:
# read employees_astyle.csv data (converted data type)
emp_df = pd.read_csv('data/employees_astyle.csv')
emp_df.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,100,Steven,King,SKING,515.123.4567,2003-06-17 00:00:00,AD_PRES,24000,0.0,0,90
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,2005-09-21 00:00:00,AD_VP,17000,0.0,100,90
2,102,Lex,De Haan,LDEHAAN,515.123.4569,2001-01-13 00:00:00,AD_VP,17000,0.0,100,90
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,2006-01-03 00:00:00,IT_PROG,9000,0.0,102,60
4,104,Bruce,Ernst,BERNST,590.423.4568,2007-05-21 00:00:00,IT_PROG,6000,0.0,103,60

In [3]:
emp_df.dtypes

EMPLOYEE_ID         int64
FIRST_NAME         object
LAST_NAME          object
EMAIL              object
PHONE_NUMBER       object
HIRE_DATE          object
JOB_ID             object
SALARY              int64
COMMISSION_PCT    float64
MANAGER_ID          int64
DEPARTMENT_ID       int64
dtype: object

In [11]:
emp_df['HIRE_DATE'] = pd.to_datetime(emp_df['HIRE_DATE'])
emp_df['HIRE_YEAR'] = pd.to_datetime(emp_df['HIRE_DATE']).dt.year
emp_df.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID,HIRE_YEAR
0,100,Steven,King,SKING,515.123.4567,2003-06-17,AD_PRES,24000,0.0,0,90,2003
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,2005-09-21,AD_VP,17000,0.0,100,90,2005
2,102,Lex,De Haan,LDEHAAN,515.123.4569,2001-01-13,AD_VP,17000,0.0,100,90,2001
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,2006-01-03,IT_PROG,9000,0.0,102,60,2006
4,104,Bruce,Ernst,BERNST,590.423.4568,2007-05-21,IT_PROG,6000,0.0,103,60,2007

In [12]:
dep_df = pd.read_excel('data/departments.xls')
dep_df.head()

ImportError: Missing optional dependency 'xlrd'. Install xlrd >= 1.0.0 for Excel support Use pip or conda to install xlrd.

In [13]:
# merge emp_df and dep_df[['DEPARTMENT_ID', 'DEPARTMENT_NAME']]
emp_df = pd.merge(emp_df, dep_df[['DEPARTMENT_ID', 'DEPARTMENT_NAME']])
emp_df.head()

NameError: name 'dep_df' is not defined

In [14]:
emp_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 107 entries, 0 to 106
Data columns (total 12 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   EMPLOYEE_ID     107 non-null    int64
 1   FIRST_NAME      107 non-null    object
 2   LAST_NAME       107 non-null    object
 3   EMAIL           107 non-null    object
 4   PHONE_NUMBER    107 non-null    object
 5   HIRE_DATE       107 non-null    datetime64[ns]
 6   JOB_ID          107 non-null    object
 7   SALARY          107 non-null    int64
 8   COMMISSION_PCT  107 non-null    float64
 9   MANAGER_ID      107 non-null    int64
 10  DEPARTMENT_ID   107 non-null    int64
 11  HIRE_YEAR       107 non-null    int64
dtypes: datetime64[ns](1), float64(1), int64(5), object(5)
memory usage: 10.2+ KB

In [15]:
emp_df.describe()

,EMPLOYEE_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID,HIRE_YEAR
count,107.000000,107.000000,107.000000,107.000000,107.000000,107.000000
mean,153.000000,6461.831776,0.072897,123.598131,63.364486,2005.448598
std,31.032241,3909.579731,0.115595,23.543561,20.874464,1.655372
min,100.000000,2100.000000,0.000000,0.000000,10.000000,2001.000000
25%,126.500000,3100.000000,0.000000,108.000000,50.000000,2005.000000
50%,153.000000,6200.000000,0.000000,122.000000,50.000000,2006.000000
75%,179.500000,8900.000000,0.150000,145.000000,80.000000,2007.000000
max,206.000000,24000.000000,0.400000,205.000000,110.000000,2008.000000

In [16]:
emp_df.describe(include='O')

       FIRST_NAME LAST_NAME  EMAIL  PHONE_NUMBER  JOB_ID
count         107       107    107           107     107
unique         91       102    107           107      19
top         Peter      King  SKING  515.123.4567  SA_REP
freq            3         2      1             1      30

## Statistics on 1 column

In [17]:
salary = emp_df.SALARY
salary

0      24000
1      17000
2      17000
3       9000
4       6000
       ...
102     6000
103     6500
104    10000
105    12008
106     8300
Name: SALARY, Length: 107, dtype: int64

In [18]:
salary.count()

107

In [19]:
salary.sum()

691416

In [20]:
salary.mean()

6461.8317757009345

In [21]:
salary.median()

6200.0

In [22]:
s = pd.Series([1,2,3,4,1,2,5,7,1,2])

In [23]:
s.value_counts()

1    3
2    3
3    1
4    1
5    1
7    1
dtype: int64

In [24]:
s.mode()

0    1
1    2
dtype: int64

In [25]:
# Most common value: Most common salary
salary.mode() #=> series

0    2500
Name: SALARY, dtype: int64

In [26]:
salary.value_counts()

2500     6
3200     4
3100     4
2800     4
2600     4
10000    4
9000     4
7000     3
9500     3
11000    3
2900     3
8000     3
17000    2
3600     2
3000     2
3300     2
2200     2
2400     2
2700     2
7500     2
4200     2
6500     2
12008    2
10500    2
6000     2
4800     2
6200     2
8200     2
8800     1
6100     1
8600     1
24000    1
8400     1
4100     1
3400     1
7400     1
3800     1
4000     1
3900     1
4400     1
13000    1
7300     1
14000    1
9600     1
11500    1
6400     1
6800     1
7200     1
12000    1
13500    1
3500     1
2100     1
5800     1
7900     1
6900     1
7800     1
7700     1
8300     1
Name: SALARY, dtype: int64

In [27]:
salary.min()

2100

In [28]:
salary.max()

24000

In [29]:
salary.std()

3909.5797305524825

In [30]:
salary.var()

15284813.669546822

In [31]:
salary.quantile(0.25) # Q1

3100.0

In [32]:
salary.quantile(0.5) # Q2

6200.0

In [33]:
salary.quantile(0.75) # Q3

8900.0

In [34]:
salary.sort_values()

32     2100
36     2200
28     2200
35     2400
27     2400
      ...
46    13500
45    14000
2     17000
1     17000
0     24000
Name: SALARY, Length: 107, dtype: int64

In [35]:
salary

0      24000
1      17000
2      17000
3       9000
4       6000
       ...
102     6000
103     6500
104    10000
105    12008
106     8300
Name: SALARY, Length: 107, dtype: int64

In [36]:
salary.sort_values(ascending=False)

0     24000
2     17000
1     17000
45    14000
46    13500
      ...
27     2400
35     2400
28     2200
36     2200
32     2100
Name: SALARY, Length: 107, dtype: int64

In [37]:
# employee statistics by year of employment
emp_df.HIRE_YEAR.value_counts()

2005    29
2006    24
2007    19
2008    11
2004    10
2002     7
2003     6
2001     1
Name: HIRE_YEAR, dtype: int64

In [40]:
emp_df.count()

EMPLOYEE_ID       107
FIRST_NAME        107
LAST_NAME         107
EMAIL             107
PHONE_NUMBER      107
HIRE_DATE         107
JOB_ID            107
SALARY            107
COMMISSION_PCT    107
MANAGER_ID        107
DEPARTMENT_ID     107
HIRE_YEAR         107
dtype: int64

In [41]:
emp_df.dtypes

EMPLOYEE_ID                int64
FIRST_NAME                object
LAST_NAME                 object
EMAIL                     object
PHONE_NUMBER              object
HIRE_DATE         datetime64[ns]
JOB_ID                    object
SALARY                     int64
COMMISSION_PCT           float64
MANAGER_ID                 int64
DEPARTMENT_ID              int64
HIRE_YEAR                  int64
dtype: object

In [42]:
emp_df.sum(numeric_only=True)

EMPLOYEE_ID        16371.0
SALARY            691416.0
COMMISSION_PCT         7.8
MANAGER_ID         13225.0
DEPARTMENT_ID       6780.0
HIRE_YEAR         214583.0
dtype: float64

In [43]:
emp_df.mean(numeric_only=True)

EMPLOYEE_ID        153.000000
SALARY            6461.831776
COMMISSION_PCT       0.072897
MANAGER_ID         123.598131
DEPARTMENT_ID       63.364486
HIRE_YEAR         2005.448598
dtype: float64

In [44]:
emp_df.median(numeric_only=True)

EMPLOYEE_ID        153.0
SALARY            6200.0
COMMISSION_PCT       0.0
MANAGER_ID         122.0
DEPARTMENT_ID       50.0
HIRE_YEAR         2006.0
dtype: float64

In [45]:
emp_df.min(numeric_only=True)

EMPLOYEE_ID        100.0
SALARY            2100.0
COMMISSION_PCT       0.0
MANAGER_ID           0.0
DEPARTMENT_ID       10.0
HIRE_YEAR         2001.0
dtype: float64

In [46]:
emp_df.max(numeric_only=True)

EMPLOYEE_ID         206.0
SALARY            24000.0
COMMISSION_PCT        0.4
MANAGER_ID          205.0
DEPARTMENT_ID       110.0
HIRE_YEAR          2008.0
dtype: float64

In [47]:
emp_df.std(numeric_only=True)

EMPLOYEE_ID         31.032241
SALARY            3909.579731
COMMISSION_PCT       0.115595
MANAGER_ID          23.543561
DEPARTMENT_ID       20.874464
HIRE_YEAR            1.655372
dtype: float64

In [48]:
emp_df.var(numeric_only=True)

EMPLOYEE_ID       9.630000e+02
SALARY            1.528481e+07
COMMISSION_PCT    1.336228e-02
MANAGER_ID        5.542992e+02
DEPARTMENT_ID     4.357433e+02
HIRE_YEAR         2.740257e+00
dtype: float64

In [49]:
emp_df.quantile(0.25, numeric_only=True)

EMPLOYEE_ID        126.5
SALARY            3100.0
COMMISSION_PCT       0.0
MANAGER_ID         108.0
DEPARTMENT_ID       50.0
HIRE_YEAR         2005.0
Name: 0.25, dtype: float64

In [50]:
emp_df.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID,HIRE_YEAR
0,100,Steven,King,SKING,515.123.4567,2003-06-17,AD_PRES,24000,0.0,0,90,2003
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,2005-09-21,AD_VP,17000,0.0,100,90,2005
2,102,Lex,De Haan,LDEHAAN,515.123.4569,2001-01-13,AD_VP,17000,0.0,100,90,2001
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,2006-01-03,IT_PROG,9000,0.0,102,60,2006
4,104,Bruce,Ernst,BERNST,590.423.4568,2007-05-21,IT_PROG,6000,0.0,103,60,2007

In [51]:
emp_df.sort_values(by='EMPLOYEE_ID')

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID,HIRE_YEAR
0,100,Steven,King,SKING,515.123.4567,2003-06-17,AD_PRES,24000,0.0,0,90,2003
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,2005-09-21,AD_VP,17000,0.0,100,90,2005
2,102,Lex,De Haan,LDEHAAN,515.123.4569,2001-01-13,AD_VP,17000,0.0,100,90,2001
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,2006-01-03,IT_PROG,9000,0.0,102,60,2006
4,104,Bruce,Ernst,BERNST,590.423.4568,2007-05-21,IT_PROG,6000,0.0,103,60,2007
...,...,...,...,...,...,...,...,...,...,...,...,...
102,202,Pat,Fay,PFAY,603.123.6666,2005-08-17,MK_REP,6000,0.0,201,20,2005
103,203,Susan,Mavris,SMAVRIS,515.123.7777,2002-06-07,HR_REP,6500,0.0,101,40,2002
104,204,Hermann,Baer,HBAER,515.123.8888,2002-06-07,PR_REP,10000,0.0,101,70,2002
105,205,Shelley,Higgins,SHIGGINS,515.123.8080,2002-06-07,AC_MGR,12008,0.0,101,110,2002
106,206,William,Gietz,WGIETZ,515.123.8181,2002-06-07,AC_ACCOUNT,8300,0.0,205,110,2002

In [52]:
emp_df.sort_values('HIRE_DATE', ascending=False)

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID,HIRE_YEAR
73,173,Sundita,Kumar,SKUMAR,011.44.1343.329268,2008-04-21,SA_REP,6100,0.1,148,80,2008
67,167,Amit,Banda,ABANDA,011.44.1346.729268,2008-04-21,SA_REP,6200,0.1,147,80,2008
66,166,Sundar,Ande,SANDE,011.44.1346.629268,2008-03-24,SA_REP,6400,0.1,147,80,2008
28,128,Steven,Markle,SMARKLE,650.124.1434,2008-03-08,ST_CLERK,2200,0.0,120,50,2008
65,165,David,Lee,DLEE,011.44.1346.529268,2008-02-23,SA_REP,6800,0.1,147,80,2008
...,...,...,...,...,...,...,...,...,...,...,...,...
103,203,Susan,Mavris,SMAVRIS,515.123.7777,2002-06-07,HR_REP,6500,0.0,101,40,2002
104,204,Hermann,Baer,HBAER,515.123.8888,2002-06-07,PR_REP,10000,0.0,101,70,2002
105,205,Shelley,Higgins,SHIGGINS,515.123.8080,2002-06-07,AC_MGR,12008,0.0,101,110,2002
106,206,William,Gietz,WGIETZ,515.123.8181,2002-06-07,AC_ACCOUNT,8300,0.0,205,110,2002
2,102,Lex,De Haan,LDEHAAN,515.123.4569,2001-01-13,AD_VP,17000,0.0,100,90,2001

In [53]:
df = emp_df.iloc[:,[0,1,2,7]]
df.head()

   EMPLOYEE_ID FIRST_NAME LAST_NAME  SALARY
0          100     Steven      King   24000
1          101      Neena   Kochhar   17000
2          102        Lex   De Haan   17000
3          103  Alexander    Hunold    9000
4          104      Bruce     Ernst    6000

In [54]:
df.sort_values(by=['SALARY','LAST_NAME'],ascending=[True,False])

    EMPLOYEE_ID FIRST_NAME   LAST_NAME  SALARY
32          132         TJ       Olson    2100
36          136      Hazel  Philtanker    2200
28          128     Steven      Markle    2200
27          127      James      Landry    2400
35          135         Ki         Gee    2400
..          ...        ...         ...     ...
46          146      Karen    Partners   13500
45          145       John     Russell   14000
1           101      Neena     Kochhar   17000
2           102        Lex     De Haan   17000
0           100     Steven        King   24000

[107 rows x 4 columns]

In [55]:
#emp_df.HIRE_YEAR.value_counts()
emp_df.value_counts('HIRE_YEAR')

HIRE_YEAR
2005    29
2006    24
2007    19
2008    11
2004    10
2002     7
2003     6
2001     1
dtype: int64

In [56]:
emp_df.HIRE_YEAR.value_counts()

2005    29
2006    24
2007    19
2008    11
2004    10
2002     7
2003     6
2001     1
Name: HIRE_YEAR, dtype: int64

In [57]:
emp_df.value_counts(['HIRE_YEAR', 'DEPARTMENT_NAME']).head(10)

KeyError: 'DEPARTMENT_NAME'

In [58]:
emp_df.value_counts(['HIRE_YEAR', 'DEPARTMENT_NAME']).head(10).reset_index()

KeyError: 'DEPARTMENT_NAME'

In [ ]:
emp_df.value_counts(['HIRE_YEAR', 'DEPARTMENT_NAME']).head(10).reset_index().rename(columns={0:'Cnt'})

## Groupby

In [59]:
emp_df.groupby('DEPARTMENT_NAME')

KeyError: 'DEPARTMENT_NAME'

In [ ]:
emp_df.columns

In [ ]:
emp_df.dtypes

In [ ]:
emp_df.groupby('DEPARTMENT_NAME').mean(numeric_only=True)

In [ ]:
emp_df.groupby('DEPARTMENT_NAME')[['SALARY','COMMISSION_PCT']].mean().reset_index()

In [ ]:
emp_df.groupby('DEPARTMENT_NAME',as_index=False)[['SALARY','COMMISSION_PCT']].mean()

In [ ]:
# lng nhn vin trung bnh theo nm vo lm
emp_df.groupby('HIRE_YEAR',as_index=False)['SALARY'].mean()

In [ ]:
emp_df.DEPARTMENT_NAME.value_counts()

In [ ]:
emp_df.groupby('DEPARTMENT_NAME')['EMPLOYEE_ID'].count()

In [ ]:
# m s NV theo phng ban
emp_df.groupby(by='DEPARTMENT_NAME',as_index=False)['EMPLOYEE_ID'].count()

In [ ]:
emp_df.groupby('DEPARTMENT_NAME',as_index=False)['EMPLOYEE_ID'].count().sort_values(by='EMPLOYEE_ID',ascending=False)

In [ ]:
emp_df.groupby('DEPARTMENT_NAME')['EMPLOYEE_ID'].count().reset_index().sort_values(by='EMPLOYEE_ID',ascending=False)

In [ ]:
# calculate average salary by JOB_ID
emp_df.groupby('JOB_ID')['SALARY'].mean()

In [ ]:
# view salary statistics by year of employment
emp_df.groupby('HIRE_YEAR')['SALARY'].describe()

In [ ]:
emp_df.groupby('DEPARTMENT_NAME')['SALARY'].median()

In [ ]:
emp_df.groupby('DEPARTMENT_NAME')['SALARY'].mean()

In [ ]:
emp_df.groupby('DEPARTMENT_NAME')['SALARY'].max()

In [ ]:
emp_df.groupby('DEPARTMENT_NAME')['SALARY'].count()

In [ ]:
# calculate number of employees, average salary, median, maximum, minimum by department
emp_df.groupby('DEPARTMENT_NAME')['SALARY'].agg(['count','min','max','mean','median'])

In [ ]:
emp_df.groupby('DEPARTMENT_NAME').agg(Count_Emp = pd.NamedAgg(column='EMPLOYEE_ID',aggfunc='count'),
                                     Sal_avg = pd.NamedAgg(column='SALARY',aggfunc='mean'))

In [ ]:
# count number of employees by year of employment and by department
df = emp_df.groupby(['HIRE_YEAR', 'DEPARTMENT_NAME'],as_index=False)['DEPARTMENT_ID'].count()
df.head(10)

In [ ]:
df.loc[(df.HIRE_YEAR==2007) & (df.DEPARTMENT_NAME=='IT'),'DEPARTMENT_ID'].iloc[0]

In [ ]:
df1 = pd.crosstab(index=emp_df.HIRE_YEAR, columns=emp_df.DEPARTMENT_NAME,values=emp_df.DEPARTMENT_ID,aggfunc='count')
df1.fillna(0).applymap(int)

In [ ]:
df1.loc[2007,'IT']

### Cross Tab

In [ ]:
round(pd.crosstab(index=emp_df['HIRE_YEAR'], columns=emp_df['DEPARTMENT_NAME'], 
                  values=emp_df['SALARY'], aggfunc='mean'))

In [ ]:
pd.crosstab(index=emp_df['HIRE_YEAR'], columns=emp_df['DEPARTMENT_NAME']) # m

In [ ]:
pd.crosstab(index=emp_df['HIRE_YEAR'], columns=emp_df['DEPARTMENT_NAME'], margins=True)

In [ ]:
pd.crosstab(index=emp_df['HIRE_YEAR'], columns=emp_df['DEPARTMENT_NAME'], normalize=True)

In [ ]:
pd.crosstab(index=emp_df['HIRE_YEAR'], columns=emp_df['DEPARTMENT_NAME'], normalize='index')

In [ ]:
pd.crosstab(columns=emp_df.DEPARTMENT_NAME, index=emp_df.HIRE_YEAR, values=emp_df.SALARY,aggfunc='sum')

### Pivot table

In [ ]:
pd.pivot_table(data=emp_df, columns='DEPARTMENT_NAME', index='HIRE_YEAR', values='SALARY',aggfunc='sum')

In [ ]:
pd.pivot_table(data=emp_df, columns='DEPARTMENT_NAME', index='HIRE_YEAR', values='SALARY',fill_value=0)

In [ ]:
pivot = round(pd.pivot_table(data=emp_df, index='DEPARTMENT_NAME', columns='HIRE_YEAR', values='SALARY')) # mean
pivot

In [ ]:
#sum
round(pd.pivot_table(data=emp_df, index='DEPARTMENT_NAME', columns='HIRE_YEAR', 
                     values='SALARY', aggfunc='sum'))

### Melt

In [ ]:
pivot = pivot.reset_index()
pivot

In [ ]:
unpivoted_df = pd.melt(pivot, id_vars=['DEPARTMENT_NAME'], var_name='HIRE_YEAR_tmp', value_name='mean_SALARY')

# Delete NaN
unpivoted_df = unpivoted_df.dropna()

# Display unpivoted DataFrame
unpivoted_df

In [ ]:
# Save emp_df to csv file (with department information)
emp_df.to_csv('data/employees_full.csv', index=False)

In [ ]:
df = pd.DataFrame({'Name': {0: 'John', 1: 'Bob', 2: 'Shiela'},
                   'Course': {0: 'Masters', 1: 'Graduate', 2: 'Graduate'},
                   'Age': {0: 27, 1: 23, 2: 21}})
df

In [ ]:
pd.melt(df, id_vars=['Name'])

In [ ]:
pd.melt(df, id_vars=['Name'], value_vars=['Age'],var_name='col1',value_name='col 2')

In [ ]:
pd.melt(df, id_vars=['Name','Course'], value_vars=['Age'])

In [ ]:
pd.melt(df, id_vars=['Name','Course'], value_vars=['Age'],
        var_name='ChangedVarname', value_name='ChangedValname')

In [ ]:
pd.melt(df, id_vars=['Name'], value_vars=['Course'],
        var_name='ChangedVarname', value_name='ChangedValname')

## Group cols

In [ ]:
emp_df.columns

In [ ]:
df = emp_df.groupby(['HIRE_YEAR','DEPARTMENT_NAME'])['SALARY'].mean().reset_index()
df.head()

In [ ]:
df = emp_df.groupby(['HIRE_YEAR','DEPARTMENT_NAME'],as_index=False)['SALARY'].mean()
df.head()

In [ ]:
emp_df.groupby(['HIRE_YEAR','DEPARTMENT_NAME'])['SALARY'].mean()